; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	image1 - mode
	image0 - mode
	Star4 - direction
	Star1 - direction
	Star3 - direction
	Star0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 image0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star3)
	(supports instrument5 image0)
	(calibration_target instrument5 Star5)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument8 image1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star5)
	(supports instrument9 image0)
	(supports instrument9 image1)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 Star1)
	(supports instrument10 image1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument11 image0)
	(supports instrument11 image1)
	(calibration_target instrument11 Star5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
)
(:goal (and
	(pointing satellite4 Phenomenon9)
	(pointing satellite5 Star4)
	(have_image Star6 image1)
	(have_image Phenomenon7 image1)
	(have_image Star8 image0)
	(have_image Phenomenon9 image0)
	(have_image Star10 image0)
))

)

; plan
1. (turn_to satellite4 star0 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star0)
   goals met: 1 of 7
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 1 of 7
3. (calibrate satellite4 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 1 of 7
4. (turn_to satellite4 star6 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 star6)
   goals met: 1 of 7
5. (take_image satellite4 star6 instrument10 image1)
   added: (have_image star6 image1)
   goals met: 2 of 7
6. (turn_to satellite4 star10 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star10)
   goals met: 2 of 7
7. (take_image satellite4 star10 instrument10 image0)
   added: (have_image star10 image0)
   goals met: 3 of 7
8. (turn_to satellite4 phenomenon7 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 phenomenon7)
   goals met: 3 of 7
9. (take_image satellite4 phenomenon7 instrument10 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 7
10. (turn_to satellite4 star8 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star8)
   goals met: 4 of 7
11. (take_image satellite4 star8 instrument10 image0)
   added: (have_image star8 image0)
   goals met: 5 of 7
12. (turn_to satellite4 phenomenon9 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 phenomenon9)
   goals met: 6 of 7
13. (take_image satellite4 phenomenon9 instrument10 image0)
   added: (have_image phenomenon9 image0)
   goals met: 7 of 7
